# -*- coding: utf-8 -*-
"""Drozdova_Lab2

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1DzkdUe5z-5FMQrhjWkarV88s3-ULHl7Y

# Лабораторная работа №2
## Решение проблемы собственных значений. Численное решение нелинейных уравнений.

# Задание 1
Написать программу, которая находит максимальное по модулю собственное значение (пару максимальных по модулю
собственных значений) и соответствующий ему (им) собственный вектор (собственные векторы) матрицы 𝐴 с максимально
возможной точностью (в пределах обычных double чисел). Применить программу к следующим ниже входным данным. В отчете
подробно изложить способ определения случая и критерия остановки итераций. Проведите экспериментальное исследование
скорости работы вашей программы в зависимости от размерности матрицы, используя для тестов матрицу со случайными
числами. Постройте график зависимости времени работы от размерности. Вычислите асимптотическую сложность
реализованного вами алгоритма.

Будем использовать степенной метод. 
На каждой итерации будем проверять 3 случая:

1.   $|λ_1|>|λ_2| \geq |λ_3| \geq  ...\geq |λ_n| $
2.  $ λ_1 = -λ_2, |λ_2| > |λ_3| \geq |λ_4| \geq ... \geq |λ_n| $
3. $λ_1, λ_2 - $ комплексно-сопряженная пара.

Для 1 и 2 случая критерий остановки будет следующим:
$|λ^k - λ^{k+1}| < ε$, где $λ^i - $ собственное значение, полученное на $i$-ом шаге.
Т.к. мы можем сравнивать только модули комплексных чисел, то для 3 случая был выбран другой критерий остановки.
Если $λ^k = a^k + i\cdot b^k - $ собственное значение, полученное на $k$-ом шаге, то алгоритм остановится, если $ \sqrt{((λ^k - λ^{k+1}).real)^2 + ((λ^k - λ^{k+1}).imag)^2} $, где $.real, .imag - $ действительная и мнимая части соответственно.

Решим задание для первой матрицы.
"""

A = [
     [1, -2, 1, 0, -1, 1, -2, 2, 0, -2],
     [0, 2, 0, 0, 2, 1, -1, -1, -1, -2],
     [0, 1, 0, -1, 1, -1, 0, -1, 1, -1],
     [-2, -1, 2, -1, 0, 0, 0, 0, 1, 0],
     [1, -2, 0, 1, 0, -2, -1, 0, 2, 2],
     [-2, -2, 0, -2, 0, 1, 1, -2, 1, 1],
     [-1, -2, -1, -1, -2, -1, -2, 1, -1, 2],
     [-2, 1, 2, -2, 0, 2, 1, -1, -2, 2],
     [0, 1, 0, 1, 1, -2, 2, 0, 1, 1],
     [0, 0, 2, -1, -1, 0, -2, 2, -1, -1]
]
y_0 = [-1,  1,  0,  2, -2, 1, 0,  0, 1, -1]
eps = 10 ** (-9)
solution = find_eigenvector(y_0, eps)
print("eigenvalue = ", solution[1])
print("eigenvector = ", solution[2])

"""Теперь найдем найдем собственное значение и собственный вектор для второй матрицы."""

A = [
     [-1, 1, -1, 0, -1, 0, -1, 1, 1, -1, 0, -1, -1, 1, 0, 0, 1, 1, 1, 1],
     [-1, 0, -1, 1, -1, 0, 0, 0, 0, -1, 0, 0, -1, 1, 0, -1, 1, -1, -1, 0],
     [1, 0, -1, 1, 0, 1, -1, -1, -1, 0, -1, -1, 1, -1, 1, 1, -1, 1, -1, 0],
     [-1, 1, 0, 0, -1, 0, 0, -1, 0, -1, 1, 1, -1, -1, 1, 1, -1, 1, -1, 0],
     [1, 0, -1, 0, 0, -1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, -1, 0, 0, 1],
     [0, 0, 0, 0, -1, 1, 1, 0, 0, 1, 1, 0, -1, 0, 1, 1, 0, 1, 0, 0],
     [-1, 0, 1, 1, 1, -1, -1, 0, -1, 1, -1, -1, -1, 0, -1, 0, 0, 0, -1, 1],
     [0, 0, -1, -1, 0, 1, 1, 1, 1, -1, 0, 0, -1, 1, 1, 1, 1, 0, 0, -1],
     [0, 0, 1, 1, 0, 1, 1, 0, 1, -1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1],
     [0, -1, 0, 0, 1, 0, -1, 0, -1, 0, -1, 0, -1, 0, 1, -1, 0, 0, 1, 1],
     [1, -1, 1, -1, -1, -1, 1, 0, -1, 0, 1, 1, -1, 0, 1, 1, 1, 0, 0, 0],
     [0, 1, 0, 0, -1, 0, 1, 0, 1, 0, 0, 1, 1, -1, -1, 0, -1, 1, 1, -1],
     [-1, -1, -1, -1, 0, 1, -1, 0, 0, -1, 0, 0, 0, 1, 1, 0, 0, 0, -1, 0],
     [-1, 0, 1, 0, -1, 0, 0, 1, -1, 1, 1, -1, 1, 1, 1, -1, 1, -1, -1, 0],
     [1, -1, 0, -1, -1, 0, -1, -1, 0, 0, 1, 0, 1, 1, -1, 1, 0, 0, -1, 0],
     [-1, -1, 1, 0, -1, 1, 1, -1, 1, 0, 0, -1, 1, -1, -1, 0, 0, 1, 1, 1],
     [0, 0, -1, 0, 0, 0, 0, -1, 1, 1, 0, -1, 1, -1, 0, 0, 0, -1, -1, 1],
     [-1, 0, -1, -1, -1, 1, 1, -1, 1, -1, 1, -1, 1, -1, 1, 1, 0, -1, 0, -1],
     [-1, 0, 1, 0, 0, 0, 0, -1, 1, -1, 1, -1, 0, -1, -1, 1, 0, 1, 0, 0],
     [0, -1, -1, 1, -1, 1, -1, -1, -1, 1, 1, -1, 0, -1, -1, 0, 1, 0, -1, -1]
     ];
y_0 = [-1,  1,  0,  2, -2, 1, 0,  0, 1, -1, -1,  1,  0,  2, -2, 1, 0,  0, 1, -1]
eps = 10 ** (-9)
solution = find_eigenvector(y_0, eps)
print("eigenvalue = ", solution[1])
print("eigenvector = ", solution[2])

"""Теперь проанализируем зависимость времени работы алгоритма от размера матрицы."""

eps = 10 ** (-3)
times = []
vals = []
for size in range(2, 151):
  A = [[0] * size for i in range(size)]
  y_0 = []
  if (size % 10 == 0):
    for i in range(size):
      y_0.append(random.randint(-5, 5))
      while (y_0[i] == 0):
        y_0[i] = random.randint(-5, 5)
      for j in range(size):
        A[i][j] = random.randint(-5, 5)
    #print(size)
    start_time = time.time()
    solution = find_eigenvector(y_0, eps)
    #print("eigenvalue = ", solution[1])
    #print("eigenvector = ", solution[2])
    #print("time = ", time.time() - start_time)
    times.append(time.time() - start_time)
    vals.append(size)
n = len(vals)
plt.plot(vals, times) 
plt.show()

"""Из графика видим, что с размером матрицы время работы увеличивается. Но так же есть и "скачки", где время работы меньше, чем у матрицы с меньшим размером. Так происходит потому, что сходимость алгоритма зависит от того, насколько максимальное собственное значение отличается от остальных.

# Задание 2
Написать программу, реализующую 𝑄𝑅-алгоритм нахождения всех собственных значений матрицы 𝐴 с максимально возможной
точностью. Применить программу к матрицам из первого задания. Проведите экспериментальное исследование скорости
работы вашей программы в зависимости от размерности матрицы, используя для тестов матрицу со случайными числами.
Постройте график зависимости времени работы от размерности. Вычислите асимптотическую сложность реализованного вами
алгоритма.

Будем выполнять итерации *QR* алгоритма, пока под главной диагональю не будет достаточное количество нулей.

После этого будем искать собственные значения. В полученной матрице будем идти по главной диагонали и рассматривать 2 случая:

1.   На *i*-ом шаге под главной диагональю стоит 0. Значит мы нашли действительное собственное значение. 
2. На *i*-ом шаге под главной диагональю стоит число, не равное 0. Значит для этого блока $ 2*2 $ будем искать собственные значения по определению.

Решим для 1ой матрицы.
"""

A = [
     [1, -2, 1, 0, -1, 1, -2, 2, 0, -2],
     [0, 2, 0, 0, 2, 1, -1, -1, -1, -2],
     [0, 1, 0, -1, 1, -1, 0, -1, 1, -1],
     [-2, -1, 2, -1, 0, 0, 0, 0, 1, 0],
     [1, -2, 0, 1, 0, -2, -1, 0, 2, 2],
     [-2, -2, 0, -2, 0, 1, 1, -2, 1, 1],
     [-1, -2, -1, -1, -2, -1, -2, 1, -1, 2],
     [-2, 1, 2, -2, 0, 2, 1, -1, -2, 2],
     [0, 1, 0, 1, 1, -2, 2, 0, 1, 1],
     [0, 0, 2, -1, -1, 0, -2, 2, -1, -1]
]

n = len(A)
while (Zeros() < (n - 1) // 2):
  MakingForm()

res = SolutionQR()
eps = 10 ** (-9)
while (1):
  MakingForm()
  new_res = SolutionQR()
  n = len(res)
  mx = 0
  for i in range(n):
    diff = res[i] - new_res[i]
    val = (diff.real ** 2 + diff.imag ** 2) ** 0.5
    mx = max(mx, val)
    res[i] = new_res[i]
  
  if (mx < eps):
    break
print("eigenvalue:")
for i in range(len(res)):
  print(res[i])

"""Аналогично для 2ой."""

A = [
     [-1, 1, -1, 0, -1, 0, -1, 1, 1, -1, 0, -1, -1, 1, 0, 0, 1, 1, 1, 1],
     [-1, 0, -1, 1, -1, 0, 0, 0, 0, -1, 0, 0, -1, 1, 0, -1, 1, -1, -1, 0],
     [1, 0, -1, 1, 0, 1, -1, -1, -1, 0, -1, -1, 1, -1, 1, 1, -1, 1, -1, 0],
     [-1, 1, 0, 0, -1, 0, 0, -1, 0, -1, 1, 1, -1, -1, 1, 1, -1, 1, -1, 0],
     [1, 0, -1, 0, 0, -1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, -1, 0, 0, 1],
     [0, 0, 0, 0, -1, 1, 1, 0, 0, 1, 1, 0, -1, 0, 1, 1, 0, 1, 0, 0],
     [-1, 0, 1, 1, 1, -1, -1, 0, -1, 1, -1, -1, -1, 0, -1, 0, 0, 0, -1, 1],
     [0, 0, -1, -1, 0, 1, 1, 1, 1, -1, 0, 0, -1, 1, 1, 1, 1, 0, 0, -1],
     [0, 0, 1, 1, 0, 1, 1, 0, 1, -1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1],
     [0, -1, 0, 0, 1, 0, -1, 0, -1, 0, -1, 0, -1, 0, 1, -1, 0, 0, 1, 1],
     [1, -1, 1, -1, -1, -1, 1, 0, -1, 0, 1, 1, -1, 0, 1, 1, 1, 0, 0, 0],
     [0, 1, 0, 0, -1, 0, 1, 0, 1, 0, 0, 1, 1, -1, -1, 0, -1, 1, 1, -1],
     [-1, -1, -1, -1, 0, 1, -1, 0, 0, -1, 0, 0, 0, 1, 1, 0, 0, 0, -1, 0],
     [-1, 0, 1, 0, -1, 0, 0, 1, -1, 1, 1, -1, 1, 1, 1, -1, 1, -1, -1, 0],
     [1, -1, 0, -1, -1, 0, -1, -1, 0, 0, 1, 0, 1, 1, -1, 1, 0, 0, -1, 0],
     [-1, -1, 1, 0, -1, 1, 1, -1, 1, 0, 0, -1, 1, -1, -1, 0, 0, 1, 1, 1],
     [0, 0, -1, 0, 0, 0, 0, -1, 1, 1, 0, -1, 1, -1, 0, 0, 0, -1, -1, 1],
     [-1, 0, -1, -1, -1, 1, 1, -1, 1, -1, 1, -1, 1, -1, 1, 1, 0, -1, 0, -1],
     [-1, 0, 1, 0, 0, 0, 0, -1, 1, -1, 1, -1, 0, -1, -1, 1, 0, 1, 0, 0],
     [0, -1, -1, 1, -1, 1, -1, -1, -1, 1, 1, -1, 0, -1, -1, 0, 1, 0, -1, -1]
     ];


n = len(A)
while (Zeros() < (n - 1) // 2):
  MakingForm()

res = SolutionQR()
eps = 10 ** (-7)
while (1):
  MakingForm()
  new_res = SolutionQR()
  n = len(res)
  mx = 0
  for i in range(n):
    diff = res[i] - new_res[i]
    val = (diff.real ** 2 + diff.imag ** 2) ** 0.5
    mx = max(mx, val)
    res[i] = new_res[i]
  
  if (mx < eps):
    break
print("eigenvalues:")
for i in range(len(res)):
  print(res[i])

"""Теперь проанализируем зависимость времени работы алгоритма от размера матрицы."""

eps = 10 ** (-3)
times = []
vals = []
for size in range(2, 21):
  A = [[0] * size for i in range(size)]
  for i in range(size):
    for j in range(size):
      A[i][j] = random.randint(-5, 5)
  #print("size = ", size)
  start_time = time.time()
  n = len(A)
  while (Zeros() < (n - 1) // 2):
    MakingForm()
  res = SolutionQR()
  while (1):
    MakingForm()
    new_res = SolutionQR()
    n = len(res)
    mx = 0
    for i in range(n):
      diff = res[i] - new_res[i]
      val = (diff.real ** 2 + diff.imag ** 2) ** 0.5
      mx = max(mx, val)
      res[i] = new_res[i]
    if (mx < eps):
      break
  times.append(time.time() - start_time)
  vals.append(size)
n = len(vals)
plt.plot(vals, times) 
plt.show()

"""Из графика видим, что с размером матрицы время работы увеличивается. Но так же есть и "скачки", где время работы меньше, чем у матрицы с меньшим размером. Так происходит потому, что сходимость алгоритма зависит от того, насколько сильно различаются собственные значения.

## Задание 3

Дано нелинейное уравнение $\frac{(x^9 + \pi) cos(ln(x^2+1))}{e^{x^2}} - \frac{x}{2022} = 0$.


Отделить все его корни. Обосновать (не обязательно доказать строго) единственность каждого корня на отрезке, отсутствие
других корней. Методом бисекции сузить отрезки отделенности корней до размера не более $10^{−4}$
. Методом Ньютона найти все
корни с максимально возможной точностью. В отчет включить количество итераций обоих методов.
"""

import numpy as np
import matplotlib.pyplot as plt

def f(x):
  return (x ** 9 + np.pi) * (np.cos(np.log(x**2 + 1))) / np.exp(x**2) - x/2022
y = lambda x: f(x)


fig = plt.subplots()
x = np.linspace(-8, 8,100000)
plt.plot(x, y(x))
ax = plt.gca() 
ax.axhline(y=0, color='k')
plt.show()

"""Из графика видно, что корни находятся на промежутках $[-2.5, -1.6], [-1.5, -1], [1.6, 2.5].$"""

y = lambda x: fp(x)
fig = plt.subplots()
x = np.linspace(-2.5, -1.6,100000)
plt.plot(x, y(x))
ax = plt.gca() 
ax.axhline(y=0, color='k')
plt.show()

y = lambda x: fp(x)
fig = plt.subplots()
x = np.linspace(-1.5, -1,100000)
plt.plot(x, y(x))
ax = plt.gca() 
ax.axhline(y=0, color='k')
plt.show()

y = lambda x: fp(x)
fig = plt.subplots()
x = np.linspace(1.6, 2.5,100000)
plt.plot(x, y(x))
ax = plt.gca() 
ax.axhline(y=0, color='k')
plt.show()

"""Как видим, производная на этих отрезках не меняет свой знак, значит на них по 1 корню.

Так же возможно есть корни на промежутках $[-6,-4.5], [4, 5]$. Чтобы проверить, есть ли они на них, посмотрим как выглядит график функции на этих промежутках.
"""

x = np.linspace(-6, -4.5,100000)
plt.plot(x, y(x))
ax = plt.gca() 
ax.axhline(y=0, color='k')

x = np.linspace(4, 5,100000)
plt.plot(x, y(x))
ax = plt.gca() 
ax.axhline(y=0, color='k')

"""Из графиков видно, что на промежутках $[-6,-4.5], [4, 5]$ корней нет."""

a = -2.5
b = -1.6
print("old borders: [", a, ", ", b, "]", sep = '')
borders = bin_search(-3, -1.5, 10**-4)
a = borders[0]
b = borders[1]
print("iter for search new borders: ", borders[2])
print("new borders: [", a, ", ", b, "]", sep = '')
x, iter = Newton(a, b, 10**-30)
print("solution: ")
print("iter = ", iter)
print("x =", x)
print("f(x) =", f(x))

a = -1.5
b = -1
print("old borders: [", a, ", ", b, "]", sep = '')
borders = bin_search(a, b, 10**-4)
a = borders[0]
b = borders[1]
print("iter for search new borders: ", borders[2])
print("new borders: [", a, ", ", b, "]", sep = '')
x, iter = Newton(a, b, 10**-30)
print("solution: ")
print("iter = ", iter)
print("x =", x)
print("f(x) =", f(x))

a = 1.6
b = 2.5
print("old borders: [", a, ", ", b, "]", sep = '')
borders = bin_search(a, b, 10**-4)
a = borders[0]
b = borders[1]
print("iter for search new borders: ", borders[2])
print("new borders: [", a, ", ", b, "]", sep = '')
x, iter = Newton(a, b, 10**-30)
print("solution: ")
print("iter = ", iter)
print("x =", x)
print("f(x) =", f(x))

"""Как видим, метод Ньютона нашел ответ за 3 итерации, что является хорошим результатом.

Далее представлены функции, которые использовались в коде выше.

Метод бисекции для уточнения границ промежутков.
"""

def bin_search(a, b, eps):
  iter = 0
  while(b - a > eps):
    m = (b + a) / 2
    iter += 1
    if (f(a) * f(m) > 0):
      a = m
    else:
      b = m
  return [a, b, iter]

"""Поиск значения функции в точке х."""

def fp(x):
  fraction1 = -2 * np.exp(-(x**2))*(x**9 + np.pi) * x * np.sin(np.log(x**2 + 1)) / (x**2 + 1)
  fraction2 = -2 * np.exp(-(x**2))*(x**9 + np.pi) * x * np.cos(np.log(x**2 + 1))
  fraction3 = 9 * np.exp(-(x**2)) * (x ** 8) * np.cos(np.log(x**2 + 1)) - 1 /2022
  return fraction1 + fraction2 + fraction3

"""Метод Ньютона для поиска решений."""

def Newton(a, b, eps):
  x0 = b
  x1 = (a + b) /2
  iter = 0
  while(abs(x1-x0) > eps):
    x0 = x1
    x1 = x0 - f(x0)/fp(x0)
    iter += 1
  return x1, iter

import random
import time
import matplotlib.pyplot as plt

"""Перемножение матриц."""

def MultiplyMatrix(A, B):
  n = len(A)
  C = [[0] * n for i in range(n)]
  for i in range(n):
    for j in range(n):
      for l in range(n):
        C[i][j] += A[i][l] * B[l][j]
  return C

"""Нормирование вектора и получение нормы вектора."""

def normalize(a):
  mx = get_norm(a)
  res = []
  n = len(a)
  for i in range(n):
    x = a[i]
    res.append(x / mx)
  return res

  
def get_norm(a):
  mx = 0
  n = len(a)
  for i in range(n):
    x = a[i]
    mx = max(mx, abs(x))
  return mx

"""Умножение матрицы на вектор."""

def Multiply(A, b):
  n = len(b)
  res = [0] * n
  for i in range(n):
    for j in range(len(A[i])):
      res[i] += A[i][j] * b[j]
  return res

"""Поиск собственных значений степенным методом."""

import math
def find_eigenvector(y, eps):
  n = len(y)
  u1 = []
  yi = []
  yi_1 = []
  for i in range(n):
    u1.append(y[i])
    yi.append(y[i])
    yi_1.append((y[i]))
  l1 = 2**31
  l2 = l1
  l3 = complex(l1)
  iter = 0
  case1 = 1
  case2 = 1
  case3 = 1
  diff1 = l1
  diff2 = l1
  diff3 = l1
  case_solution = -1
  eigenvalue = 0
  eigenvector = []
  while(case1 or case2 or case3):
    iter+=1
    if case1:
      res = solve_case1(A, u1, l1)
      if (diff1 < abs(l1 - res[1]) and iter > 20):
        case1 = 0
      diff1 = abs(l1 - res[1])
      l1 = res[1]
      if (res[0] == 1):
        case_solution = 1
        eigenvalue = l1
        eigenvector = u1
        break

    if case2:
      res = solve_case2(A, yi, l2)
      if (diff2 < abs(l2 - res[1]) and iter > 20):
        case2 = 0
      diff2 = abs(l2 - res[1])
      l2 = res[1]
      if (res[0] == 1):
        case_solution = 2
        eigenvalue = l2
        eigenvector = res[3]
        break
      else:
        for i in range(n):
          yi[i] = res[2][i]

    if case3:
      res = solve_case3(A, yi_1, l3)
      if (iter > 700):
        case3 = 0
      if (((l3.real - res[1].real) ** 2 + abs(l3.imag - res[1].imag) ** 2) ** 0.5 < eps):
        case_solution = 3
        eigenvalue = res[1]
        eigenvector = res[2]
        break
      l3 = res[1]
      for i in range(n):
        yi_1[i] = res[3][i]
  return [case_solution, eigenvalue, eigenvector]

"""Степенной метод, 1 случай"""

def solve_case1(A, u, l):
  v = Multiply(A, u)
  j = 0
  n = len(v)
  for i in range(n):
    if math.fabs(u[j]) < math.fabs(u[i]) and v[i] != 0:
      j = i
  l1 = v[j] / u[j]
  for i in range(n):
    u[i] = v[i] / v[j]
  if abs(l1 - l) < eps:
    return [1, l1]
  return [0, l1]

"""Степенной метод, 2 случай"""

def solve_case2(A, yi, l):
  yi1 = Multiply(A, yi)
  yi2 = Multiply(A, yi1)
  j = 0
  n = len(yi2)
  norm_yi2 = 0
  for i in range(n):
    norm_yi2 = max(norm_yi2, yi2[i])
    if math.fabs(yi[j]) < math.fabs(yi[i]):
      j = i
  l1 = (abs(yi2[j] / yi[j]))**0.5
  v = [0] * n
  norm = 0
  for i in range(n):
    v[i] = yi2[i] + l1 * yi[i] # собственный вектор
    norm += v[i] ** 2
  norm = norm ** 0.5
  for i in range(n):
    v[i] /= norm
  for i in range(n):
    yi2[i] /= norm_yi2
  
  if abs(l1 - l) < eps:
    return [1, l1, yi2, v]
  return [0, l1, yi2, v]

"""Степенной метод, 3 случай"""

def solve_case3(A, ui_1, l_last):
  n = len(ui_1)

  vi = Multiply(A, ui_1)
  ui = normalize(vi)

  vi1 = Multiply(A, ui)
  ui1 = normalize(vi1)

  vi2 = Multiply(A, ui1)
  ui2 = normalize(vi2)

  j = -1
  mx = 0
  for i in range(n):
    if (vi1[i] != 0 and 
        abs(vi[i] * vi2[i] * get_norm(vi1) - vi1[i] * vi1[i] * get_norm(vi)) != 0 
        and abs(ui_1[i] * vi1[i] - (ui[i] ** 2)*get_norm(vi)) > mx 
        and abs(ui_1[i] * vi1[i] - (ui[i] ** 2)*get_norm(vi)) * vi1[i] != 0):
      mx = abs(ui_1[i] * vi1[i] - (ui[i] ** 2)*get_norm(vi))
      j = i
  
  r = abs(vi[j] * vi2[j] * get_norm(vi1) - vi1[j] * vi1[j] * get_norm(vi))
  r /= mx
  r = r ** 0.5

  cosf = vi2[j] * get_norm(vi1) + r * r * ui[j]
  cosf /= 2 * r * vi1[j]

  sinf = (1 - cosf ** 2) ** 0.5
  lyambda = complex(r * cosf, r * sinf)
  v = [0] * n
  for i in range(n):
    v[i] = vi1[i] - lyambda * ui[i]
  nev = Multiply(A, v)
  norm = 0
  for i in range(n):
    nev[i] -= lyambda * v[i]
    norm += nev[i] ** 2
  return [0, lyambda, v, ui2, norm ** 0.5]

"""Получение транспонированной матрицы."""

def T(Q, n):
  QT = [[0] * n for i in range(n)]
  for i in range(n):
    for j in range(n):
      QT[i][j] = Q[j][i]
  return QT

"""Получение единичной матрицы."""

def IdentityMatrix(n):
  E = [[0] * n for i in range(n)]
  for i in range(n):
    E[i][i] = 1
  return E

"""Приведение к нужной форме, для QR алгоритма."""

def MakingForm():
  global A
  n = len(A)
  Q = IdentityMatrix(n)

  for j in range(n - 1):
    for i in range(j + 1, n):
      # зануляем [i][j] элемент
      if (A[i][j] == 0):
        continue
      det = (A[i][j] **2 + A[j][j] ** 2) ** 0.5
      sinf = A[i][j] / det
      cosf = A[j][j] / det

      Givens = IdentityMatrix(n)
      Givens[i][i] = cosf
      Givens[j][j] = cosf
      Givens[i][j] = -sinf
      Givens[j][i] = sinf
      A = MultiplyMatrix(Givens, A)
      Q = MultiplyMatrix(Q, T(Givens, n))
  A = MultiplyMatrix(A, Q)

"""Поиск количества нулей под главной диагональю."""

def Zeros():
  global A
  n = len(A)
  eps = 10 ** (-15)
  zeros = 0
  for i in range(n - 1):
    if (abs(A[i+1][i]) < eps):
      zeros += 1
  return zeros

"""Поиск решения на приведенной к нужной форме матрице."""

def SolutionQR():
  global A
  n = len(A)
  eps = 10 ** (-9)
  result = []
  i = 0
  while i < n:
    if (i == n - 1 or (i + 1 < n and abs(A[i + 1][i]) < eps)):
      result.append(complex(A[i][i]))
      i += 1
    else:
      D = (A[i][i] + A[i + 1][i + 1]) ** 2 - 4 * (A[i][i] * A[i + 1][i + 1] - A[i + 1][i] * A[i][i + 1])
      l1 = (A[i][i] + A[i + 1][i + 1] - complex(D) ** 0.5) / 2
      l2 = (A[i][i] + A[i + 1][i + 1] + complex(D) ** 0.5) / 2
      i += 2
      result.append(l1)
      result.append(l2)
  return result